Revit 2027 API
PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(Document, ElementId) Method
 Identifies if the provided member is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsElementValidIntersectingReference(
	Document document,
	ElementId elementId
)
Public Shared Function IsElementValidIntersectingReference (
	document As Document,
	elementId As ElementId
) As Boolean
public:
static bool IsElementValidIntersectingReference(
	Document^ document,
	ElementId^ elementId
)
static member IsElementValidIntersectingReference :
        document : Document *
        elementId : ElementId -> bool
Parameters
document Document
 The document.
elementId ElementId
 Element ids to be tested for validity for intersecting references.
Return Value
Boolean
 True if the reference is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
IsElementValidIntersectingReference Overload
Autodesk.Revit.DB Namespace